Yr8/8-CS-Cryptography/pages/6_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Cryptography</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Cryptography</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/MarcScott/8-CS-Cryptography">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="assessment.html">Assessment</a></li>

    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Implementing public key cryptography in Python</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Last lesson you learned a little about public key cryptography
</li>
<li>To recap, public key cryptography involves two keys - a public and a private key.
</li>
<li>Anyone can encrypt a message using the public key.
</li>
<li>Only the holder of the private key can decrypt the message.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Learn It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Public Key cryptography relies on prime numbers.
</li>
<li>Prime numbers are numbers that are only divisible by 1 and themselves.
</li>
<li>So the first few primes are 2,3,5,7,11.
</li>
<li>And <a href="http://primes.utm.edu/lists/small/1000.txt">here is a list of the first 1000 primes</a>
</li>
<li>We're going to implement a <span class="underline">very poor</span> version of the RSA encryption algorithm.
</li>
<li>It would not be a good idea to encrypt data that you really wanted to keep secret using our implementation.
</li>
<li>You have learned <a href="http://lmgtfy.com/?q=What+is+the+answer+to+Life,+the+Universe+and+Everything">The answer to Life, the Universe and Everything</a> and naturally you want to tell a few close friends, but you don't want everyone to know the answer.
</li>
<li>You're going to write a script that will enable your friends to get their very own private keys. You can then encrypt <i>The Answer</i> with their public key, so only they can see it.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 code">
<h3 id="sec-1-3">Code It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>The first thing we need to do i pick two prime numbers and a third that is smaller than the other two.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #cd0000;">#</span><span style="color: #cd0000;">Choose three primes</span>
<span style="color: #cdcd00;">prime1</span> =
<span style="color: #cdcd00;">prime2</span> =
<span style="color: #cdcd00;">prime3</span> =
</pre>
</div>
<ul class="org-ul">
<li>Use the list linked above to choose any three primes <span class="underline">below 100</span>
</li>
<li>Now we need to generate a public key. This is actually really easy.
</li>
<li>It's just the product of the first two primes, and the third prime.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #cd0000;">#</span><span style="color: #cd0000;">Create the public key</span>
<span style="color: #cdcd00;">publicKey</span> = (prime1*prime2,prime3)
<span style="color: #00cdcd; font-weight: bold;">print</span>(<span style="color: #00cd00;">'Your public key is'</span>, publicKey,<span style="color: #00cd00;">'.You can share this with your friends'</span>)
</pre>
</div>
<ul class="org-ul">
<li>Of course, we'll also need to generate a private key. This is a little trickier.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 learn">
<h3 id="sec-1-4">Learn It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>We're going to need to get into some fairly tricky maths now.
</li>
<li>We'll start by learning about the <i>modulo</i> operator in maths.
</li>
<li>If you were asked what is <code>5/2</code> then you'd probably come up with the answer <code>2.5</code>
</li>
<li>When we first learn to divide though, we often talk about remainders.
</li>
<li>So <code>2/5</code> is equal to <code>2</code> with a remainder of <code>1</code>
</li>
<li>The <i>modulo</i> operator will tell you the remainder when two integers are divided.
</li>
<li>In Python we use the <code>%</code> symbol.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 code">
<h3 id="sec-1-5">Code It</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Try typing the following into the interpreter
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">15%5
15%7
15%13
15%4
15%11
</pre>
</div>
<ul class="org-ul">
<li>Each one gives the remainder of the division.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3 learn">
<h3 id="sec-1-6">Learn It</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>The next stage is to find what is known as the totient function of each prime.
</li>
<li><i>Coprime</i> numbers are pairs of numbers where <span class="underline">both</span> numbers can only be exactly divided by 1.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3 try">
<h3 id="sec-1-7">Try It</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Lets look at the number 10.
</li>
<li>To calculate the totient function of the number 10, first list all the numbers below it.
<ul class="org-ul">
<li><code>9,8,7,6,5,4,3,2,1</code>
</li>
</ul>
</li>
<li>For each number, see if it is coprime with 10. Have a go at filling in the question marks.
<ul class="org-ul">
<li><code>9 and 10</code> can both only be divide by 1.
</li>
<li><code>8 and 10</code> can be divided by ?
</li>
<li><code>7 and 10</code> can only be divided by 1.
</li>
<li><code>6 and 10</code> can be divided by ?
</li>
<li><code>5 and 10</code> can be divided by ?
</li>
<li><code>4 and 10</code> can be divided by ?
</li>
<li><code>3 and 10</code> can only be divided by 1
</li>
<li><code>2 and 10</code> can be divided ?
</li>
<li><code>1 and 10</code> can only be divided by 1
</li>
</ul>
</li>
<li>So counting up we have 4 coprimes, so the totient function of 10 is 4
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3 badge">
<h3 id="sec-1-8">Badge It - Silver</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Calculate the totient function of the following numbers.
<ol class="org-ol">
<li>7
</li>
<li>12
</li>
<li>13
</li>
<li>23
</li>
</ol>
</li>
<li>Both 13 and 23 are prime numbers. Look carefully at the totient values you calculated.
</li>
<li>What do you think the totient of the following primes would be?
<ol class="org-ol">
<li>43
</li>
<li>107
</li>
<li>7919
</li>
</ol>
</li>
<li>Write down the rule for calculating the totient function of prime numbers.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3 code">
<h3 id="sec-1-9">Code It</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>Now let's add in our totient function
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #cdcd00;">phi1</span> = prime1 - 1
<span style="color: #cdcd00;">phi2</span> = prime2 - 1
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3 learn">
<h3 id="sec-1-10">Learn It</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>Now we need to find a magic number (called <code>d</code>).
</li>
<li>d is a number such that when it is <i>multiplied</i> by our third prime and then <i>divided</i> by the product of our two totient functions, the remainder will be exactly 1.
</li>
</ul>
<div>
<math xmlns='http://www.w3.org/1998/Math/MathML' display='block'>
<mfrac>
<mrow>
<mi>d</mi>
<mo>x</mo>
<mi>prime3</mi>
</mrow>
<mrow>
<mi>phi1</mi>
<mo>x</mo>
<mi>phi2</mi>
</mrow>
</mfrac>
<mo>=</mo>
<mn>1</mn>
</math>
</div>
<ul class="org-ul">
<li>There are various ways to calculate <code>d</code>, but we're going to go for the simplest solution.
</li>
<li>We'll just test every value from 1 upwards until we hit a value for d.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-11" class="outline-3 code">
<h3 id="sec-1-11">Code It</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>Let's start by creating a for loop that counts from d up to the product of our two totient.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">for</span> d <span style="color: #00cdcd; font-weight: bold;">in</span> <span style="color: #0000ee; font-weight: bold;">range</span>(phi1*phi2):
    <span style="color: #00cdcd; font-weight: bold;">print</span>(d)
</pre>
</div>
<ul class="org-ul">
<li>What's the first number in the list of printed numbers?
</li>
<li>Why might this be a problem? (What does division by 0 give you?)
</li>
<li>Let's fix the code then and give our for loop a starting point.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">for</span> d <span style="color: #00cdcd; font-weight: bold;">in</span> <span style="color: #0000ee; font-weight: bold;">range</span>(1,phi1*phi2):
    <span style="color: #00cdcd; font-weight: bold;">print</span>(d)
</pre>
</div>
<ul class="org-ul">
<li>Does that fix the issue?
</li>
<li>Now we need to test the equation written above.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">for</span> d <span style="color: #00cdcd; font-weight: bold;">in</span> <span style="color: #0000ee; font-weight: bold;">range</span>(1,phi1*phi2):
    <span style="color: #00cdcd; font-weight: bold;">if</span> (d * prime3)%(phi1 * phi2) == 1:
        <span style="color: #00cdcd; font-weight: bold;">print</span>(d)
</pre>
</div>
<ul class="org-ul">
<li>The number (or first of the numbers) listed is the value we want for d.
</li>
<li>So if d is found, we should stop the loop.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">for</span> d <span style="color: #00cdcd; font-weight: bold;">in</span> <span style="color: #0000ee; font-weight: bold;">range</span>(1,phi1*phi2):
    <span style="color: #00cdcd; font-weight: bold;">if</span> (d * prime3)%(phi1 * phi2) == 1:
        <span style="color: #00cdcd; font-weight: bold;">print</span>(d)
        <span style="color: #00cdcd; font-weight: bold;">break</span>
</pre>
</div>
<ul class="org-ul">
<li>Let's make sure that we save the value of d along with the product of our original primes, as this will be our private key.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">for</span> d <span style="color: #00cdcd; font-weight: bold;">in</span> <span style="color: #0000ee; font-weight: bold;">range</span>(1,phi1*phi2):
    <span style="color: #00cdcd; font-weight: bold;">if</span> (d * prime3)%(phi1 * phi2) == 1:
        <span style="color: #cdcd00;">privateKey</span> = prime1*prime2,d
        <span style="color: #00cdcd; font-weight: bold;">break</span>
<span style="color: #00cdcd; font-weight: bold;">print</span>(<span style="color: #00cd00;">'Your private key is'</span>,privateKey)
</pre>
</div>
<ul class="org-ul">
<li>So now we have both public and private keys.
</li>
<li>Try running your program and then typing <code>publicKey</code> into the interpreter. Then try <code>privateKey</code>.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-12" class="outline-3 badge">
<h3 id="sec-1-12">Badge It - Gold</h3>
<div class="outline-text-3" id="text-1-12">
<ul class="org-ul">
<li>Now we have the public and private keys, we can encrypt and decrypt numbers.
</li>
<li>The algorithm for encryption is as follows.
<ol class="org-ol">
<li>Take the secret number you want to encrypt (42)
</li>
<li>Raise it to the power of the second part of your public key
</li>
<li>Calculate the remainder when the result is divided by the first part of your public key
</li>
</ol>
</li>
<li>The algorithm for decryption is as follows.
<ol class="org-ol">
<li>Take the encrypted secret number.
</li>
<li>Raise it to the power of the second part of your private key
</li>
<li>Calculate the remainder when the result is divided by the first part of your public key.
</li>
</ol>
</li>
<li>Try and write two lines of code that will encrypt the number (and save it as <code>cipherText</code>) then decrypt <code>cipherText</code> and save it as <code>plainText</code>.
</li>
<li>Hints
<ol class="org-ol">
<li>To raise one number to the power of another use <code>**</code>
<ul class="org-ul">
<li>6**2 = 36
</li>
<li>10**5 = 100000
</li>
</ul>
</li>
<li>To get the first element of publicKey use <code>publicKey[0]</code>, to get the second element use <code>publicKey[1]</code>
<ul class="org-ul">
<li><code>publicKey =(187,7)</code>
</li>
<li><code>publicKey[0] = 187</code>
</li>
<li><code>publicKey[1] = 7</code>
</li>
</ul>
</li>
<li>Use modulo <code>%</code> to get the remainder of the division.
</li>
</ol>
</li>
<li>Test your code when you are finished by printing <code>cipherText</code> and <code>plainText</code>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-13" class="outline-3 test">
<h3 id="sec-1-13">Test It</h3>
<div class="outline-text-3" id="text-1-13">
<ul class="org-ul">
<li>Our algorithm is actually pretty poor, and should never be used for real cryptography.
</li>
<li>While it might encrypt the number 42 well enough, try it with a much larger number.
</li>
<li>What happens?
</li>
<li>Try increasing the size of your prime numbers, using the linked list we used at the start.
</li>
<li>What happens when you use three large primes?
</li>
<li>Real cryptography uses extremely large primes. Why would this be a problem for our algorithm.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-14" class="outline-3 badge">
<h3 id="sec-1-14">Badge It - Platinum</h3>
<div class="outline-text-3" id="text-1-14">
<ul class="org-ul">
<li>Generate a public and private key (Don't use large prime numbers).
</li>
<li>Write down your public key on a bit of paper and give it to your teacher.
</li>
<li>Your teacher is then going to write you a short message, using numbers.
</li>
<li>Decrypt each number using your private key, then translate it back into text as follows.
</li>
<li>A = 1 up to Z = 26
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
